MaxCrazy1101/LCR/.pack/GigaDevice/GD32F4xx_DFP.3.0.3/GigaDevice.GD32F4xx_DFP.pdsc
  </conditions>

  <components>
    <!-- GD32F4xx_StdPeripherals -->
    <component Cclass="Device" Cgroup="StdPeripherals" Csub="ADC" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Analog-to-digital converter (ADC) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_adc.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_adc.c" attr="config" version="3.0.2" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeripherals" Csub="CAN" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Controller Area Network (CAN) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAN
        </RTE_Components_h>
        <files>
          <!-- CAN flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_can.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_can.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="CRC" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Cyclic Redundancy Check (CRC) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_crc.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_crc.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="CTC" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Clock trim controller (CTC) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CTC
        </RTE_Components_h>
        <files>
          <!-- CTC flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_ctc.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_ctc.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="DAC" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Digital-to-analog converter (DAC) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DAC
        </RTE_Components_h>
        <files>
          <!-- DAC flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_dac.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_dac.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="DBG" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Debug (DBG) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DBG
        </RTE_Components_h>
        <files>
          <!-- DBG flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_dbg.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_dbg.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="DCI" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Digital camera interface (DCI) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DCI
        </RTE_Components_h>
        <files>
          <!-- DCI flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_dci.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_dci.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="DMA" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Direct Memory Access (DMA) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_dma.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_dma.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="ENET" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Ethernet(ENET) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ENET
        </RTE_Components_h>
        <files>
          <!-- ENET flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_enet.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_enet.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="EXMC" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>External memory controller(EXMC) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXMC
        </RTE_Components_h>
        <files>
          <!-- EXMC flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_exmc.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_exmc.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="EXTI" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>External Interrupt/Event (EXTI) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXTI
        </RTE_Components_h>
        <files>
          <!-- EXTI flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_exti.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_exti.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="FMC" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Flash Memory Controller (FMC) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FMC
        </RTE_Components_h>
        <files>
          <!-- FMC flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_fmc.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_fmc.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="FWDGT" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Free watchdog timer(FWDGT) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FWDGT
        </RTE_Components_h>
        <files>
          <!-- FWDGT flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_fwdgt.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_fwdgt.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="GPIO" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_gpio.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_gpio.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="I2C" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Inter-integrated Circuit (I2C) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_i2c.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_i2c.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="IPA" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Image processing accelerator (IPA) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_IPA
        </RTE_Components_h>
        <files>
          <!-- IPA flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_ipa.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_ipa.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="IREF" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Programmable current reference(IREF) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_IREF
        </RTE_Components_h>
        <files>
          <!-- IREF flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_iref.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_iref.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="MISC" Cversion="3.0.2" condition="GD32F4xx CMSIS">
      <description>MISC driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_misc.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_misc.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="PMU" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Power Managment Unit(PMU) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PMU
        </RTE_Components_h>
        <files>
          <!-- PMU flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_pmu.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_pmu.c" attr="config" version="3.0.2" />
        </files>
    </component>

