MaxCrazy1101/LCR/.pack/GigaDevice/GD32F4xx_DFP.3.0.3/GigaDevice.GD32F4xx_DFP.pdsc
  <component Cclass="Device" Cgroup="StdPeripherals" Csub="RCU" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS MISC">
      <description>Reset and Clock Control (RCU) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RCU
        </RTE_Components_h>
        <files>
          <!-- RCU flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_rcu.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_rcu.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="RTC" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Real-time Clock (RTC) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
        </RTE_Components_h>
        <files>
          <!-- RTC flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_rtc.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_rtc.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="SDIO" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Secure digital input/output interface(SDIO) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SDIO
        </RTE_Components_h>
        <files>
          <!-- SDIO flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_sdio.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_sdio.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="SPI_I2S" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI_I2S) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_spi.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_spi.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="SYSCFG" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>System Configuration(SYSCFG) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SYSCFG
        </RTE_Components_h>
        <files>
          <!-- SYSCFG flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_syscfg.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_syscfg.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="TIMER" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>TIMER driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TIMER
        </RTE_Components_h>
        <files>
          <!-- TIMER flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_timer.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_timer.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="TLI" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>TFT-LCD interface(TLI) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TLI
        </RTE_Components_h>
        <files>
          <!-- TLI flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_tli.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_tli.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="TRNG" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>True random number generator (TRNG) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TRNG
        </RTE_Components_h>
        <files>
          <!-- TRNG flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_trng.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_trng.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="USART" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_usart.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_usart.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="WWDGT" Cversion="3.0.2" condition="GD32F4xx 4XX_STDPERIPHERALS RCU">
      <description>Window Watchdog Timer (WWDGT) driver for GD32F4xx Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDGT
        </RTE_Components_h>
        <files>
          <!-- WWDGT flie -->
          <file category="header" name="Device/F4XX/Firmware/Peripherals/inc/gd32f4xx_wwdgt.h" />
          <file category="source" name="Device/F4XX/Firmware/Peripherals/src/gd32f4xx_wwdgt.c" attr="config" version="3.0.2" />
        </files>
    </component>

    <!-- Utilities GD32F4xx -->

   <component Cclass="Device" Cgroup="EVAL" Csub="GD32F450I" Cversion="3.0.2" condition="GD32F4xx STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/F4XX/Utilities/gd32f450i_eval.h"/>
        <!-- eval file -->
        <file category="source" name="Device/F4XX/Utilities/gd32f450i_eval.c" attr="config" version="3.0.2"/>
      </files>
    </component>

