MaxCrazy1101/LCR/.pack/GigaDevice/GD32F4xx_DFP.3.0.3/GigaDevice.GD32F4xx_DFP.pdsc
    <component Cclass="Device" Cgroup="EVAL" Csub="GD32F450Z" Cversion="3.0.2" condition="GD32F4xx STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/F4XX/Utilities/gd32f450z_eval.h"/>
        <!-- eval file -->
        <file category="source" name="Device/F4XX/Utilities/gd32f450z_eval.c" attr="config" version="3.0.2"/>
      </files>
    </component>

    <!-- Config GD32F4xx -->
    <component Cclass="Device" Cgroup="Libopt"  Cversion="3.0.2" condition="GD32F4xx CMSIS">
      <description> GD32F405/407/450 Series Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/F4XX/Include/gd32f4xx_libopt.h"/>
      </files>
    </component>


   <!-- Startup GD32F405 -->
    <component Cclass="Device" Cgroup="Startup"  Cversion="3.0.2" condition="GD32F405">
      <description>System Startup for GigaDevice GD32F405 Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/F4XX/Include/"/>
        <file category="header" name="Device/F4XX/Include/gd32f4xx.h"/>
        <!-- startup file -->
        <file category="source" name="Device/F4XX/Source/ARM/startup_gd32f405_425.s" attr="config" version="3.0.2" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/F4XX/Source/system_gd32f4xx.c"      attr="config" version="3.0.2"/>
      </files>
    </component>

   <!-- Startup GD32F407 -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="3.0.2" condition="GD32F407">
      <description>System Startup for GigaDevice GD32F407 Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/F4XX/Include/"/>
        <file category="header" name="Device/F4XX/Include/gd32f4xx.h"/>
        <!-- startup file -->
        <file category="source" name="Device/F4XX/Source/ARM/startup_gd32f407_427.s" attr="config" version="3.0.2" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/F4XX/Source/system_gd32f4xx.c"      attr="config" version="3.0.2"/>

      </files>
    </component>

   <!-- Startup GD32F450 -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="3.0.2" condition="GD32F450">
      <description>System Startup for GigaDevice GD32F450 Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/F4XX/Include/"/>
        <file category="header" name="Device/F4XX/Include/gd32f4xx.h"/>
        <!-- startup file -->
        <file category="source" name="Device/F4XX/Source/ARM/startup_gd32f450_470.s" attr="config" version="3.0.2" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/F4XX/Source/system_gd32f4xx.c"      attr="config" version="3.0.2"/>
      </files>
    </component>
 
    <!-- GD32F403_StdPeripherals -->
    <component Cclass="Device" Cgroup="StdPeripherals" Csub="ADC" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Analog-to-digital converter (ADC) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_adc.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_adc.c" attr="config" version="3.0.2" />
        </files>
    </component>

   <component Cclass="Device" Cgroup="StdPeripherals" Csub="BKP" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Backup register (BKP) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_BKP
        </RTE_Components_h>
        <files>
          <!-- BKP flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_bkp.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_bkp.c" attr="config" version="3.0.2" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeripherals" Csub="CAN" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Controller Area Network (CAN) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAN
        </RTE_Components_h>
        <files>
          <!-- CAN flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_can.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_can.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="CRC" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Cyclic Redundancy Check (CRC) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_crc.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_crc.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="CTC" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Clock trim controller (CTC) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CTC
        </RTE_Components_h>
        <files>
          <!-- CTC flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_ctc.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_ctc.c" attr="config" version="3.0.2" />
        </files>
    </component>

