MaxCrazy1101/LCR/.pack/GigaDevice/GD32F4xx_DFP.3.0.3/GigaDevice.GD32F4xx_DFP.pdsc
  <component Cclass="Device" Cgroup="StdPeripherals" Csub="DAC" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Digital-to-analog converter (DAC) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DAC
        </RTE_Components_h>
        <files>
          <!-- DAC flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_dac.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_dac.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="DBG" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Debug (DBG) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DBG
        </RTE_Components_h>
        <files>
          <!-- DBG flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_dbg.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_dbg.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="DMA" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Direct Memory Access (DMA) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_dma.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_dma.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="EXMC" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>External memory controller(EXMC) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXMC
        </RTE_Components_h>
        <files>
          <!-- EXMC flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_exmc.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_exmc.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="EXTI" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>External Interrupt/Event (EXTI) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXTI
        </RTE_Components_h>
        <files>
          <!-- EXTI flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_exti.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_exti.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="FMC" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Flash Memory Controller (FMC) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FMC
        </RTE_Components_h>
        <files>
          <!-- FMC flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_fmc.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_fmc.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="FWDGT" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Free watchdog timer(FWDGT) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FWDGT
        </RTE_Components_h>
        <files>
          <!-- FWDGT flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_fwdgt.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_fwdgt.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="GPIO" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_gpio.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_gpio.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="I2C" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Inter-integrated Circuit (I2C) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_i2c.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_i2c.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="MISC" Cversion="3.0.2" condition="GD32F403 CMSIS">
      <description>MISC driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_misc.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_misc.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="PMU" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Power Managment Unit(PMU) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PMU
        </RTE_Components_h>
        <files>
          <!-- PMU flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_pmu.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_pmu.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="RCU" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS MISC">
      <description>Reset and Clock Control (RCU) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RCU
        </RTE_Components_h>
        <files>
          <!-- RCU flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_rcu.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_rcu.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="RTC" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Real-time Clock (RTC) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
        </RTE_Components_h>
        <files>
          <!-- RTC flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_rtc.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_rtc.c" attr="config" version="3.0.2" />
        </files>
    </component>

