MaxCrazy1101/LCR/.pack/GigaDevice/GD32F4xx_DFP.3.0.3/GigaDevice.GD32F4xx_DFP.pdsc
  <component Cclass="Device" Cgroup="StdPeripherals" Csub="SDIO" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Secure digital input/output interface(SDIO) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SDIO
        </RTE_Components_h>
        <files>
          <!-- SDIO flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_sdio.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_sdio.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="SPI_I2S" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI_I2S) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_spi.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_spi.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="TIMER" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>TIMER driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TIMER
        </RTE_Components_h>
        <files>
          <!-- TIMER flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_timer.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_timer.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="USART" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_usart.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_usart.c" attr="config" version="3.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="StdPeripherals" Csub="WWDGT" Cversion="3.0.2" condition="GD32F403 403_STDPERIPHERALS RCU">
      <description>Window Watchdog Timer (WWDGT) driver for GD32F403 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDGT
        </RTE_Components_h>
        <files>
          <!-- WWDGT flie -->
          <file category="header" name="Device/F403/Firmware/Peripherals/inc/gd32f403_wwdgt.h" />
          <file category="source" name="Device/F403/Firmware/Peripherals/src/gd32f403_wwdgt.c" attr="config" version="3.0.2" />
        </files>
    </component>

    <!-- Utilities GD32F403 -->
    <component Cclass="Device" Cgroup="EVAL" Csub="GD32F403" Cversion="3.0.2" condition="GD32F403 STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/F403/Utilities/gd32f403z_eval.h"/>
        <!-- eval file -->
        <file category="source" name="Device/F403/Utilities/gd32f403z_eval.c" attr="config" version="3.0.2"/>
      </files>
    </component>

    <!-- Config GD32F403 -->
    <component Cclass="Device" Cgroup="Libopt"   Cversion="3.0.2" condition="GD32F403 CMSIS">
      <description>GD32F403 Series Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/F403/Include/gd32f403_libopt.h"/>
      </files>
    </component>

   <!-- Startup GD32F403 -->
    <component Cclass="Device" Cgroup="Startup"  Cversion="3.0.2" condition="GD32F403">
      <description>System Startup for GigaDevice GD32F403 Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/F403/Include/"/>
        <file category="header" name="Device/F403/Include/gd32f403.h"/>
        <!-- startup file -->
        <file category="source" name="Device/F403/Source/ARM/startup_gd32f403.s" attr="config" version="3.0.2" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/F403/Source/system_gd32f403.c"      attr="config" version="3.0.2"/>
      </files>
    </component>

</components>
</package>
